tests/result_clusterinfo.artillery.txt
Phase started: unnamed (index: 0, duration: 1s) 04:17:38(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 04:17:39(-0300)

--------------------------------------
Metrics for period to: 04:17:40(-0300) (width: 1.799s)
--------------------------------------

http.codes.200: ................................................................ 714
http.codes.302: ................................................................ 733
http.request_rate: ............................................................. 832/sec
http.requests: ................................................................. 1483
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 100
  median: ...................................................................... 34.1
  p95: ......................................................................... 77.5
  p99: ......................................................................... 92.8
http.responses: ................................................................ 1447
vusers.completed: .............................................................. 14
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 594.4
  max: ......................................................................... 1584.6
  median: ...................................................................... 1022.7
  p95: ......................................................................... 1525.7
  p99: ......................................................................... 1525.7


--------------------------------------
Metrics for period to: 04:17:50(-0300) (width: 0.657s)
--------------------------------------

http.codes.200: ................................................................ 286
http.codes.302: ................................................................ 267
http.request_rate: ............................................................. 517/sec
http.requests: ................................................................. 517
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 66
  median: ...................................................................... 30.9
  p95: ......................................................................... 61
  p99: ......................................................................... 63.4
http.responses: ................................................................ 553
vusers.completed: .............................................................. 36
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1288.2
  max: ......................................................................... 1891.4
  median: ...................................................................... 1620
  p95: ......................................................................... 1863.5
  p99: ......................................................................... 1901.1


All VUs finished. Total time: 3 seconds

--------------------------------
Summary report @ 04:17:41(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.codes.302: ................................................................ 1000
http.request_rate: ............................................................. 675/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 100
  median: ...................................................................... 32.8
  p95: ......................................................................... 71.5
  p99: ......................................................................... 89.1
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 594.4
  max: ......................................................................... 1891.4
  median: ...................................................................... 1525.7
  p95: ......................................................................... 1863.5
  p99: ......................................................................... 1901.1