tests/result_forkinfo.artillery.txt
Phase started: unnamed (index: 0, duration: 1s) 04:15:52(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 04:15:53(-0300)

--------------------------------------
Metrics for period to: 04:16:00(-0300) (width: 3.966s)
--------------------------------------

http.codes.200: ................................................................ 1000
http.codes.302: ................................................................ 1000
http.request_rate: ............................................................. 508/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 256
  median: ...................................................................... 66
  p95: ......................................................................... 159.2
  p99: ......................................................................... 186.8
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2223.1
  max: ......................................................................... 3303.2
  median: ...................................................................... 3072.4
  p95: ......................................................................... 3262.4
  p99: ......................................................................... 3262.4


All VUs finished. Total time: 5 seconds

--------------------------------
Summary report @ 04:15:58(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.codes.302: ................................................................ 1000
http.request_rate: ............................................................. 508/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 256
  median: ...................................................................... 66
  p95: ......................................................................... 159.2
  p99: ......................................................................... 186.8
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2223.1
  max: ......................................................................... 3303.2
  median: ...................................................................... 3072.4
  p95: ......................................................................... 3262.4
  p99: ......................................................................... 3262.4